app/controllers/job_recruiters_controller.rb

  def view_applied_job
    begin
    # @job= @current_user.jobs.find(params[:id])
    applied_applications = @job.user_applications
    if ! applied_applications.blank?
---
SELECT 1 AS one FROM "user_applications" WHERE "user_applications"."job_id" = ? LIMIT ?  [["job_id", 7], ["LIMIT", 1]]
SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."job_id" = ?  [["job_id", 1]]

  def index
    applications = UserApplication.where(status: params[:status])
---
SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."status" = ?  [["status", "set_param"]]

  def update
    # seeker_application = UserApplication.find(params[:id])
    # if seeker_application.update(set_param)
    #   render json: "Application Updated"
    # else
    #   render json: seeker_application.errors.full_messages
    # end

    job_application= @job.user_applications.find(params[:id])
    if job_application.update(recruiter_param)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."job_id" = ? AND "user_applications"."id" = ? LIMIT ?  [["job_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "user_applications" SET "status" = ?, "updated_at" = ? WHERE "user_applications"."id" = ?  [["status", "applied"], ["updated_at", "2023-09-06 12:52:55.981660"], ["id", 1]]