app/controllers/job_seeker_controller.rb

  def index
    if params[:f_name]
      users = UserProfile.search_user_by_name(params[:f_name])
      render json: users
    else
      users = UserProfile.all
---
SELECT "user_profiles".* FROM "user_profiles" WHERE (f_name LIKE '%r%')