app/controllers/job_seekers_controller.rb

  def view_all_jobs
    if params[:job_title].present?
      jobs = Job.search_job_by_title(params[:job_title])
      render json: jobs
    else
      render json: Job.all.includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 21], ["id", 22]]