app/controllers/passwords_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "\"dfrhwe\""], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER(?) AND "users"."id" != ? LIMIT ?  [["email", "akshatp@shriffle.com"], ["id", 25], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "akshatp@shriffle.com"], ["LIMIT", 1]]
---
  def forgot_password
    user = User.find_by(email: params[:email]) # if present find user by email
    if user.present?

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def reset_password
    token = params[:token]#.to_s
    user = User.find_by(reset_password_token: token)

    if user.present? && user.password_token_valid?