app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ritik123@gmail.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by_email(params[:email])

INSERT INTO "users" ("user_name", "password_digest", "email", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
---
  def create
    @user = User.new(user_params)
    if @user.save
      UserMailer.with(user: @user).welcome_email.deliver_now

UPDATE "users" SET "user_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "Ritikdhote"], ["updated_at", "2023-09-19 05:16:11.217714"], ["id", 21]]
---
  def update
    if @current_user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]
---
  def destroy
    if @current_user.destroy