app/controllers/users_application_controller.rb

SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."user_id" = ?  [["user_id", 7]]
---
  def index
    seeker_all_applications=@current_user.user_applications.all

INSERT INTO "user_applications" ("status", "job_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", "applied"], ["job_id", 1], ["user_id", 3], ["created_at", "2023-09-06 05:50:12.744931"], ["updated_at", "2023-09-06 05:50:12.744931"]]
---
  def create
    application = @current_user.user_applications.new(user_application_param)
    if application.save

DELETE FROM "user_applications" WHERE "user_applications"."id" = ?  [["id", 11]]
---
  def destroy
    if @user_application.destroy

UPDATE "user_applications" SET "status" = ?, "updated_at" = ? WHERE "user_applications"."id" = ?  [["status", "reject"], ["updated_at", "2023-09-08 06:07:47.205319"], ["id", 2]]
---
  def update
    if @user_application.update(user_application_param)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."user_id" = ? AND "user_applications"."id" = ? LIMIT ?  [["user_id", 4], ["id", 2], ["LIMIT", 1]]
---
  def set_param
    @user_application = @current_user.user_applications.find_by_id(params[:id])

SELECT "user_applications".* FROM "user_applications" WHERE "user_applications"."user_id" = ? AND "user_applications"."id" = ? LIMIT ?  [["user_id", 4], ["id", 10], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_applications" WHERE "user_applications"."user_id" = ? AND "user_applications"."job_id" = ? LIMIT ?  [["user_id", 4], ["job_id", 2], ["LIMIT", 1]]
---
  def has_applied?
    if UserApplication.where(user_id: @current_user.id, job_id: params[:job_id]).any?